DataProcessors/атл_ИнформацияОХодеОбменаДаннымиУМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>атл_ИнформацияОХодеОбменаДаннымиУМС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПопыткиОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоУспешногоОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменУспешноРаботает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменЗапущен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатусОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОХодеОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбОшибкахОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОшибокВЛогах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/атл_НастройкиПодсистемыУМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>атл_НастройкиПодсистемыУМС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛогинОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПарольОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьШифрованноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьСинхронизацииССервером</Name>
					<Comment>Периодичность синхронизации с сервером в секундах (минимум 10 секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательДляВыполненияОбменаДанными</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьШифрованиеДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщийКлючШифрования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.атл_КлючиШифрования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьФоновыйРежимОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресКартыДляОтображенияТочек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВходящиеУдачноРазобранныеПакетыОтМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВходящиеУдачноРазобранныеПакетыОтСервера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВЛогахИнформационныеСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВЛогахИнформационныеСообщенияОПакетахОтСервера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимОтладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьСтатистикуОбменов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяПроверкаДанныхОВыполненныхРаботахВЗадачеМобильномуСотруднику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойШаблонЗаполненияЗадачМобильнымСотрудникам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.атл_ШаблоныЗаполненияЗадачМобильнымСотрудникам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособУказанияДатыНазначенияПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.атл_СпособУказанияДатыНазначения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШиротаАдресОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолготаАдресОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресКартыДляОтображенияТочекВебКлиент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапускHTTPСервисаРаботаСКартойЛогин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапускHTTPСервисаРаботаСКартойПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/атл_ЛогиОбменаУМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>атл_ЛогиОбменаУМС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЛога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.атл_ВидыЛогов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВнешнегоПакета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЛога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/атл_ПеременныеСинхронизацииССерверомУМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>атл_ПеременныеСинхронизацииССерверомУМС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторСессииПодключенияКСерверуУМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаголовокHTTP</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСинхронизацийДоЗапросаАктивностиМобильныхСотрудников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КукиФоновогоОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейПопыткиОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоУспешногоОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПервогоЛога</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьАвторизованнойИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПоследнегоОбновленияТрека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПоследнегоОбновленияАктивностиПользователей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоОбновленияРасписанияМобильныхСотрудников</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/атл_ВидыЛогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>атл_ВидыЛогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОшибкаРазбораДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформационноеСообщениеОРазбореДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПодключенияКСерверу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформационноеСообщениеОбУспешномПодключенииКСерверу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОтправкиДанных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/атл_ИнформацияОХодеОбменаДаннымиУМС/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаписьНастроекПодключения = РегистрыСведений.атл_НастройкиПодсистемыУМС.СоздатьМенеджерЗаписи();
	ЗаписьНастроекПодключения.Прочитать();
	
	ПериодичностьСинхронизацииССервером = ЗаписьНастроекПодключения.ПериодичностьСинхронизацииССервером;		
	
	ПроверитьХодОбменаНаСервере();
	ПроверитьНаличиеОшибокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПериодичностьСинхронизацииССервером < 15 Тогда
		ПериодичностьСинхронизацииССервером = 15;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПроверитьХодОбмена", ПериодичностьСинхронизацииССервером);
	ПодключитьОбработчикОжидания("ПроверитьНаличиеОшибок", 300); //каждые пять минут

	Если АктивироватьФорму Тогда
		ЭтаФорма.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ОтключитьОбработчикОжидания("ПроверитьХодОбмена");
	ОтключитьОбработчикОжидания("ПроверитьНаличиеОшибок");
	
КонецПроцедуры


#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ИнформацияОбОшибкахОбменаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаРегистраЛогов =  ПолучитьФорму("РегистрСведений.атл_ЛогиОбменаУМС.ФормаСписка");		
	мОтбор = ФормаРегистраЛогов.Список.Отбор.Элементы;
	мОтбор.Очистить();
	
	мНовыйОтбор = мОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	мНовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаСоздания");
	мНовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	мНовыйОтбор.ПравоеЗначение = НачалоДня(ТекущаяДата());
	мНовыйОтбор.Использование = Истина;	
	
	ФормаРегистраЛогов.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ПроверитьХодОбмена();
	ПроверитьНаличиеОшибок();	
	
КонецПроцедуры

#КонецОбласти



#Область ПрочиеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьХодОбмена()
	
	АктивироватьФорму = Ложь;
	ПроверитьХодОбменаНаСервере();	
	Если АктивироватьФорму Тогда
		ЭтаФорма.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеОшибок()
	
	АктивироватьФорму = Ложь;
	ПроверитьНаличиеОшибокНаСервере();
	Если АктивироватьФорму Тогда
		ЭтаФорма.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьХодОбменаНаСервере()

	//считываем параметры из данных о синхронизации
	мЗаписьПараметровСинхронизацииССервером = РегистрыСведений.атл_ПеременныеСинхронизацииССерверомУМС.СоздатьМенеджерЗаписи();
	мЗаписьПараметровСинхронизацииССервером.Прочитать();
	Объект.ДатаПоследнегоУспешногоОбмена = мЗаписьПараметровСинхронизацииССервером.ДатаПоследнегоУспешногоОбмена;
	Объект.ДатаПоследнейПопыткиОбмена = мЗаписьПараметровСинхронизацииССервером.ДатаПоследнейПопыткиОбмена;
	
	Если ЗначениеЗаполнено(Объект.ДатаПоследнегоУспешногоОбмена) Тогда
		Если ЗначениеЗаполнено(Объект.ДатаПоследнейПопыткиОбмена) Тогда
			Если Объект.ДатаПоследнегоУспешногоОбмена = Объект.ДатаПоследнейПопыткиОбмена Тогда
				Объект.ИнформацияОХодеОбмена = "Дата последнего успешного обмена: " + Объект.ДатаПоследнегоУспешногоОбмена;
			Иначе
				Объект.ИнформацияОХодеОбмена = "Дата последнего успешного обмена: " + Объект.ДатаПоследнегоУспешногоОбмена + Символы.ПС + 
										"Дата последней попытки обмена: " + Объект.ДатаПоследнейПопыткиОбмена;
			КонецЕсли;
		Иначе
			Объект.ИнформацияОХодеОбмена = "Дата последнего успешного обмена: " + Объект.ДатаПоследнегоУспешногоОбмена + Символы.ПС + 
									"Дата последней попытки обмена: " + Объект.ДатаПоследнейПопыткиОбмена;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Объект.ДатаПоследнейПопыткиОбмена) Тогда
			Объект.ИнформацияОХодеОбмена = "Успешного обмена не было...." + Символы.ПС + 
								"Дата последней попытки обмена: " + Объект.ДатаПоследнейПопыткиОбмена;
		Иначе
			Объект.ИнформацияОХодеОбмена = "Успешного обмена не было...." + Символы.ПС + 
								"Попыток обмена не было...";
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущаяПроверяемаяДата = ТекущаяДата();
	
	Если Объект.ТекущийСтатусОбмена = "" Тогда
		ОтобразитьИзменениеСтатусаОбмена = Истина;
	Иначе
		ОтобразитьИзменениеСтатусаОбмена = Ложь;	
	КонецЕсли;
	
	Если ТекущаяПроверяемаяДата < Объект.ДатаПоследнегоУспешногоОбмена + 8 * ПериодичностьСинхронизацииССервером Тогда
		//обмен нормально работает
		Если Объект.ОбменУспешноРаботает Тогда
			//все хорошо
		Иначе
			ОтобразитьИзменениеСтатусаОбмена = Истина;	
			
			Объект.ОбменЗапущен = Истина;
			Объект.ОбменУспешноРаботает = Истина;
		КонецЕсли;
	Иначе
		//обмен не работает
		Если ТекущаяПроверяемаяДата < Объект.ДатаПоследнейПопыткиОбмена + 8 * ПериодичностьСинхронизацииССервером Тогда
			//но пытается работать
			Если Не Объект.ОбменЗапущен или Объект.ОбменУспешноРаботает Тогда
				ОтобразитьИзменениеСтатусаОбмена = Истина;	
				
				Объект.ОбменЗапущен = Истина;
				Объект.ОбменУспешноРаботает = Ложь;
			Иначе
				//ничего не менялось. Обмен запущен и не работает
			КонецЕсли;
		Иначе
			//видимо даже не запущена обработка или регламентное задание
			Если Объект.ОбменЗапущен или Объект.ОбменУспешноРаботает Тогда
				ОтобразитьИзменениеСтатусаОбмена = Истина;	
				
				Объект.ОбменЗапущен = Ложь;
				Объект.ОбменУспешноРаботает = Ложь;
			Иначе
				//ничего не менялось. Обмен не запущен и не работает
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ОтобразитьИзменениеСтатусаОбмена Тогда
		Если Объект.ОбменУспешноРаботает Тогда
			Объект.ТекущийСтатусОбмена = "Обмен данными запущен и успешно работает";
			ЦветСтатуса = Новый Цвет(46,139,87);
			ЭтаФорма.Заголовок = "Обмен с мобильными сотрудниками";
		ИначеЕсли Не Объект.ОбменУспешноРаботает и Объект.ОбменЗапущен Тогда
			Объект.ТекущийСтатусОбмена = "ВНИМАНИЕ! Обмен данными запущен, но НЕ РАБОТАЕТ!";
			ЦветСтатуса = Новый Цвет(255,0,0);
			ЭтаФорма.Заголовок = "ВНИМАНИЕ! Обмен с мобильными сотрудниками";
		ИначеЕсли Не Объект.ОбменУспешноРаботает и Не Объект.ОбменЗапущен Тогда
			Объект.ТекущийСтатусОбмена = "ВНИМАНИЕ! Обмен данными НЕ ЗАПУЩЕН!";
			ЦветСтатуса = Новый Цвет(255,0,0);
			ЭтаФорма.Заголовок = "ВНИМАНИЕ! Обмен с мобильными сотрудниками";
		Иначе
			ЦветСтатуса = Новый Цвет(0,0,0);
		КонецЕсли;
				
		Элементы.ТекущийСтатусОбмена.ЦветТекста = ЦветСтатуса;		
		АктивироватьФорму = Истина;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеОшибокНаСервере()

	ТекущаяПроверяемаяДата = ТекущаяДата();
	
	мСписокВидовЛогов = Новый СписокЗначений;
	мСписокВидовЛогов.Добавить(Перечисления.атл_ВидыЛогов.ОшибкаПодключенияКСерверу);
	мСписокВидовЛогов.Добавить(Перечисления.атл_ВидыЛогов.ОшибкаРазбораДанных);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	атл_ЛогиОбменаУМС.ИдентификаторЛога
	|ИЗ
	|	РегистрСведений.атл_ЛогиОбменаУМС КАК атл_ЛогиОбменаУМС
	|ГДЕ
	|	атл_ЛогиОбменаУМС.ВидЛога В(&СписокВидовЛогов)
	|	И атл_ЛогиОбменаУМС.ДатаСоздания >= &НачальнаяДатаСоздания";
	
	Запрос.УстановитьПараметр("СписокВидовЛогов", мСписокВидовЛогов);
	Запрос.УстановитьПараметр("НачальнаяДатаСоздания", НачалоДня(ТекущаяПроверяемаяДата));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	КоличествоОшибокВЗапросе = Выборка.Количество();
	
	Если Объект.КоличествоОшибокВЛогах <> КоличествоОшибокВЗапросе Тогда
		//появились новые ошибки....
		
		Если КоличествоОшибокВЗапросе = 0 Тогда
			Объект.ИнформацияОбОшибкахОбмена = "За сегодняшний день в логах ошибок нет";
			ЦветНаличияОшибок = Новый Цвет(46,139,87);
		Иначе
			Объект.ИнформацияОбОшибкахОбмена = "ВНИМАНИЕ! За сегодняшний день в логах ошибок: " + КоличествоОшибокВЗапросе;
			ЦветНаличияОшибок = Новый Цвет(255,0,0);
		КонецЕсли;
				
		Элементы.ИнформацияОбОшибкахОбмена.ЦветТекста = ЦветНаличияОшибок;
		Если Объект.КоличествоОшибокВЛогах = 0 Тогда
			//если раньше ошибок не было, а теперь появились, то активизируем форму
			АктивироватьФорму = Истина;
		КонецЕсли;
		
		Объект.КоличествоОшибокВЛогах = КоличествоОшибокВЗапросе;
		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти
